/******************************************************
文件名：	STD_ADFliterTypes

描述：		

Data			  Vasion			author
2018/6/27		V1.0			  liujian
*******************************************************/
#ifndef		STD_ADFLITER_TYPES_H
#define		STD_ADFLITER_TYPES_H
/*******************************************************
description： include the header file
*******************************************************/
#include	"Include.h"

/*******************************************************
description： macro definitions
*******************************************************/
/**********宏开关定义*********/


/**********宏常量定义*********/
#define  ADFLITERTYPES_PWRONFASTFLITER      0//上电快速滤波状态机
#define  ADFLITERTYPES_NORMALFLITER         1//上电完毕正常滤波状态机


/***********宏函数***********/

/*******************************************************
description： struct definitions
*******************************************************/

/*******************************************************
description： typedef definitions
*******************************************************/
/*****struct definitions*****/

/******enum definitions******/

/******union definitions*****/

/*******************************************************
description： variable External declaration
*******************************************************/

/*******************************************************
description： function External declaration
*******************************************************/


#endif
