/******************************************************
文件名：	dhcpClient

描述：		

Data			  Vasion			author
2018/06/25		  V1.0			    liujian
*******************************************************/
#ifndef		_DHCP_CLIENT_H
#define		_DHCP_CLIENT_H
/*******************************************************
description： include the header file
*******************************************************/
#include "Include.h"

/*******************************************************
description： macro definitions
*******************************************************/
/**********宏开关定义*********/

/**********宏常量定义*********/


/***********宏函数***********/


/*******************************************************
description： struct definitions
*******************************************************/

/*******************************************************
description： typedef definitions
*******************************************************/
/*****struct definitions*****/

/******union definitions*****/

/*******************************************************
description： variable External declaration
*******************************************************/



/*******************************************************
description： function External declaration
*******************************************************/
extern void InitdhcpClient_parameter(void);
extern void TskdhcpClient_MainFunction(void);

#endif 
