/******************************************************
æ–‡ä»¶åï¼š	

æè¿°ï¼

Data			  Vasion			author
2018/1/4		  V1.0			    liujian
*******************************************************/
#ifndef		INCLUDE_H
#define		INCLUDE_H
/*******************************************************
descriptionï¼šinclude the header file
*******************************************************/
/*C±ê×¼¿âÎÄ¼ş*/
#include <string.h>
#include <stdlib.h>
#include <stdio.h>


#include "iwdg.h"
#include "lwip/dhcp.h"
/*******************************************************
descriptionï¼šmacro definitions
*******************************************************/
/**********å®å¼€å…³å®šä¹*******/

/*******************************************************
description£ºOften use of macro definitions
*******************************************************/
/***********å®å‡½æ•*********/



/*******************************************************
descriptionï¼šstruct definitions
*******************************************************/

/*******************************************************
descriptionï¼štypedef definitions
*******************************************************/
/*****struct definitions*****/

/******enum definitions******/

/******union definitions*****/

/*******************************************************
descriptionï¼švariable External declaration
*******************************************************/
//extern uint16 Vemain_w_5msTskTimer;

/*******************************************************
descriptionï¼šfunction External declaration
*******************************************************/

#endif
